{
  "format": "graph-model",
  "generatedBy": "2.18.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "signature": {
    "inputs": {
      "keras_tensor_4": {
        "name": "keras_tensor_4:0",
        "dtype": "DT_FLOAT",
        "tensorShape": { "dim": [{ "size": "-1" }, { "size": "270" }] }
      }
    },
    "outputs": {
      "output_0": {
        "name": "Identity:0",
        "dtype": "DT_FLOAT",
        "tensorShape": { "dim": [{ "size": "-1" }, { "size": "1" }] }
      }
    }
  },
  "modelTopology": {
    "node": [
      {
        "name": "StatefulPartitionedCall/sequential_1_1/dense_3_1/Cast/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "270" }, { "size": "128" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1_1/dense_3_1/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "128" }] } }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1_1/dense_4_1/Cast/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }, { "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1_1/dense_4_1/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "64" }] } }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1_1/dense_5_1/Cast/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }, { "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1_1/dense_5_1/Add/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "1" }] } }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "keras_tensor_4",
        "op": "Placeholder",
        "attr": {
          "shape": { "shape": { "dim": [{ "size": "-1" }, { "size": "270" }] } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1_1/dense_3_1/Relu",
        "op": "_FusedMatMul",
        "input": [
          "keras_tensor_4",
          "StatefulPartitionedCall/sequential_1_1/dense_3_1/Cast/ReadVariableOp",
          "StatefulPartitionedCall/sequential_1_1/dense_3_1/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "transpose_a": { "b": false },
          "transpose_b": { "b": false },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "num_args": { "i": "1" },
          "leakyrelu_alpha": { "f": 0.2 },
          "epsilon": { "f": 0.0 },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1_1/dense_4_1/Relu",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/sequential_1_1/dense_3_1/Relu",
          "StatefulPartitionedCall/sequential_1_1/dense_4_1/Cast/ReadVariableOp",
          "StatefulPartitionedCall/sequential_1_1/dense_4_1/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "transpose_a": { "b": false },
          "transpose_b": { "b": false },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "num_args": { "i": "1" },
          "leakyrelu_alpha": { "f": 0.2 },
          "epsilon": { "f": 0.0 },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1_1/dense_5_1/Add",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/sequential_1_1/dense_4_1/Relu",
          "StatefulPartitionedCall/sequential_1_1/dense_5_1/Cast/ReadVariableOp",
          "StatefulPartitionedCall/sequential_1_1/dense_5_1/Add/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "transpose_a": { "b": false },
          "transpose_b": { "b": false },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA=="] } },
          "num_args": { "i": "1" },
          "leakyrelu_alpha": { "f": 0.2 },
          "epsilon": { "f": 0.0 },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "Identity",
        "op": "Identity",
        "input": ["StatefulPartitionedCall/sequential_1_1/dense_5_1/Add"],
        "attr": { "T": { "type": "DT_FLOAT" } }
      }
    ],
    "library": {},
    "versions": { "producer": 1994 }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {
          "name": "StatefulPartitionedCall/sequential_1_1/dense_3_1/Cast/ReadVariableOp",
          "shape": [270, 128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_1_1/dense_3_1/BiasAdd/ReadVariableOp",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_1_1/dense_4_1/Cast/ReadVariableOp",
          "shape": [128, 64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_1_1/dense_4_1/BiasAdd/ReadVariableOp",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_1_1/dense_5_1/Cast/ReadVariableOp",
          "shape": [64, 1],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_1_1/dense_5_1/Add/ReadVariableOp",
          "shape": [1],
          "dtype": "float32"
        }
      ]
    }
  ]
}
